<script setup>
  const data = [
    {
      title: 'Посторонние предметы и искажения',
      body: 'Убедитесь, что ваши руки или другие предметы не закрывают данные документа. При сканировании паспорта убедитесь, что страницы правильно выровнены и все данные четко видны.',
      image: 'img_1.png',
    },
    {
      title: 'Хорошее освещение.',
      body: 'Хорошее освещение помогает достичь лучших результатов OCR. Если изображение слишком темное или слишком яркое, документ может быть обработан некорректно.',
      image: 'img_2.png',
    },
    {
      title: 'Избегайте отражений',
      body: 'Блики и отражения мешают обработке и снижают точность извлечения данных. Мы рекомендуем не использовать вспышку мобильного устройства при съемке изображений документов.',
      image: 'img_3.png',
    },
    {
      title: 'Фокус и резкость',
      body: 'Убедитесь, что изображение четкое и на нем нет размытых участков.',
      image: 'img_4.png',
    },
    {
      title: 'Угол',
      body: 'Угол наклона документа не должен превышать 10 градусов в любом направлении (горизонтальном или вертикальном).',
      image: 'img_5.png',
    },
    {
      title: 'Поля (слишком малы)',
      body: 'Убедитесь, что вокруг документа есть минимальное пространство. Рекомендуется, чтобы документ занимал 70-80% изображения.',
      image: 'img_6.png',
    },
    {
      title: 'Поля (слишком большие)',
      body: 'Убедитесь, что пространство вокруг документа не занимает более 20-30% изображения. Рекомендуется, чтобы документ занимал 70-80% изображения.',
      image: 'img_7.png',
    },
    {
      title: 'Контраст',
      body: 'Документ должен четко контрастировать с фоном. Светлый документ на светлом фоне, а также темный документ на темном фоне могут быть не распознаны.',
      image: 'img_8.png',
    },
    {
      title: 'Разрешение изображения',
      body: 'Для достижения хорошего качества распознавания документов, удостоверяющих личность, рекомендуем предоставлять изображения, снятые камерой с разрешением не менее Full HD (1920×1080) и автофокусом.',
      image: 'img_9.png',
    },
  ];

</script>

<template>
  <p>Ниже приведены требования к размеру и качеству изображений документов для успешной обработки изображений:</p>

  <template v-for="item in data" :key="item.title">
    <h2>{{ item.title }}</h2>
    <p>{{ item.body }}</p>
    <el-image :src="`/src/components/Documents/images/${item.image}`" fit="scale-down">
      <template #placeholder>
        <el-skeleton animated>
          <template #template>
            <el-skeleton-item variant="image" style="width: 240px; height: 240px" />
          </template>
        </el-skeleton>
      </template>
    </el-image>
  </template>
</template>
